themes/Findhouse/Dashboard/Admin/DashboardController.php

    public static function getTopCardsReport()
    {
        $total_properties = Property::count();
        $total_views     = Property::sum('view');
        $total_favorites     = UserWishList::count();
        $total_reviews   = Review::join("bravo_properties","bravo_properties.id","bravo_review.object_id")->where("bravo_review.object_model","'property'")->count();
---
select count(*) as aggregate from `user_wishlist`
select count(*) as aggregate from `bravo_review` inner join `bravo_properties` on `bravo_properties`.`id` = `bravo_review`.`object_id` where `bravo_review`.`object_model` = '\'property\'' and `bravo_review`.`deleted_at` is null